#### Terraform Initialization`success`
#### Terraform Plan `success`

Show Plan

```terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.cloudinit_config.this: Reading...[0m[0m
[0m[1mdata.hcloud_image.this: Reading...[0m[0m
[0m[1mdata.hetznerdns_zone.this: Reading...[0m[0m
[0m[1mhcloud_network.this: Refreshing state... [id=10373733][0m
[0m[1mhcloud_ssh_key.default: Refreshing state... [id=24905759][0m
[0m[1mdata.cloudinit_config.this: Read complete after 0s [id=3370040635][0m
[0m[1mhcloud_firewall.basic: Refreshing state... [id=1748182][0m
[0m[1mdata.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ][0m
[0m[1mdata.hcloud_image.this: Read complete after 1s[0m
[0m[1mhcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24][0m
[0m[1mhcloud_server.projects-server: Refreshing state... [id=56649545][0m
[0m[1mhetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1][0m
[0m[1mhetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef][0m
[0m[1mhetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409][0m
[0m[1mhetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320][0m
[0m[1mhcloud_server_network.this: Refreshing state... [id=56649545-10373733][0m
[0m[1mhcloud_volume.this: Refreshing state... [id=101632658][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # hcloud_server.projects-server[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server" "projects-server" {
      [32m+[0m[0m backup_window              = (known after apply)
      [33m~[0m[0m datacenter                 = "fsn1-dc14" -> (known after apply)
      [33m~[0m[0m id                         = "56649545" -> (known after apply)
      [33m~[0m[0m ipv4_address               = "188.245.227.94" -> (known after apply)
      [33m~[0m[0m ipv6_address               = "2a01:4f8:c012:20a7::1" -> (known after apply)
      [33m~[0m[0m ipv6_network               = "2a01:4f8:c012:20a7::/64" -> (known after apply)
      [31m-[0m[0m labels                     = {} [90m-> null[0m[0m
        name                       = "projects-server"
      [31m-[0m[0m placement_group_id         = 0 [90m-> null[0m[0m
      [33m~[0m[0m primary_disk_size          = 40 -> (known after apply)
      [33m~[0m[0m status                     = "running" -> (known after apply)
      [33m~[0m[0m user_data                  = "SFbvFm57+9fT4U311NQbfcPQTKI=" [33m->[0m[0m "UBf878EBFpGe+OCxIJUNckTmbYA=" [31m# forces replacement[0m[0m
        [90m# (12 unchanged attributes hidden)[0m[0m
    }

[1m  # hcloud_server_network.this[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server_network" "this" {
      [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
      [33m~[0m[0m id          = "56649545-10373733" -> (known after apply)
      [33m~[0m[0m mac_address = "86:00:00:e8:fb:43" -> (known after apply)
      [33m~[0m[0m server_id   = 56649545 -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # hcloud_volume.this[0m will be updated in-place
[0m  [33m~[0m[0m resource "hcloud_volume" "this" {
        id                = "101632658"
        name              = "persistent-storage"
      [33m~[0m[0m server_id         = 56649545 -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # hetznerdns_record.bookmarks[0m will be updated in-place
[0m  [33m~[0m[0m resource "hetznerdns_record" "bookmarks" {
        id      = "da4433c705ee878f5f69348f54b956ef"
        name    = "bookmarks"
      [33m~[0m[0m value   = "188.245.227.94" -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # hetznerdns_record.bookmarks-api[0m will be updated in-place
[0m  [33m~[0m[0m resource "hetznerdns_record" "bookmarks-api" {
        id      = "81253d86efc1c38e4afb06c662d6a409"
        name    = "api.bookmarks"
      [33m~[0m[0m value   = "188.245.227.94" -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # hetznerdns_record.geometrierechner[0m will be updated in-place
[0m  [33m~[0m[0m resource "hetznerdns_record" "geometrierechner" {
        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"
        name    = "geometrierechner"
      [33m~[0m[0m value   = "188.245.227.94" -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # hetznerdns_record.homepage[0m will be updated in-place
[0m  [33m~[0m[0m resource "hetznerdns_record" "homepage" {
        id      = "912db7ec956005d7343406b8b2adb320"
        name    = "@"
      [33m~[0m[0m value   = "188.245.227.94" -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 2 to add, 5 to change, 2 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m server_ip = "188.245.227.94" -> (known after apply)
  [33m~[0m[0m status    = "running" -> (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```*